avem-labs/Avem/libs/STM32_USB-FS-Device_Lib_V4.0.0/Utilities/STM32_EVAL/STM32L152D_EVAL/stm32l152d_eval_glass_lcd.c
    /* Position 2 on LCD */
    case 2:
      /* Write Digit 0 on COM0 */
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFFCFFFF;
      LCD->RAM[LCD_RAMRegister_0] |= (uint32_t)(Digit[0] << (uint32_t)0x0F);
      /* Write Digit 1 on COM1 */
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)0xFFFCFFFF;
      LCD->RAM[LCD_RAMRegister_2] |= (uint32_t)(Digit[1] << (uint32_t)0x0F);
      /* Write Digit 2 on COM4 */
      LCD->RAM[LCD_RAMRegister_8] &= (uint32_t)0xFFFC7FFF;
      LCD->RAM[LCD_RAMRegister_8] |= (uint32_t)(Digit[2] << (uint32_t)0x0F);
      /* Write Digit 3 on COM5 */
      LCD->RAM[LCD_RAMRegister_10] &= (uint32_t)0xFFFC7FFF;
      LCD->RAM[LCD_RAMRegister_10] |= (uint32_t)(Digit[3] << (uint32_t)0x0F);
      /* Write Digit 4 on COM6 */
      LCD->RAM[LCD_RAMRegister_12] &= (uint32_t)0xFFFC7FFF;
      LCD->RAM[LCD_RAMRegister_12] |= (uint32_t)(Digit[4] << (uint32_t)0x0F);
      /* Write Digit 5 on COM7 */
      LCD->RAM[LCD_RAMRegister_14] &= (uint32_t)0xFFFC7FFF;
      LCD->RAM[LCD_RAMRegister_14] |= (uint32_t)(Digit[5] << (uint32_t)0x0F);
      break;

    /* Position 3 on LCD */
    case 3:
      /* Write Digit 0 on COM0 */
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFE7FFFF;
      LCD->RAM[LCD_RAMRegister_0] |= (uint32_t)(Digit[0] << (uint32_t)0x12);
      /* Write Digit 1 on COM1 */
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)0xFFE7FFFF;
      LCD->RAM[LCD_RAMRegister_2] |= (uint32_t)(Digit[1] << (uint32_t)0x12);
      /* Write Digit 2 on COM4 */
      LCD->RAM[LCD_RAMRegister_8] &= (uint32_t)0xFFE3FFFF;
      LCD->RAM[LCD_RAMRegister_8] |= (uint32_t)(Digit[2] << (uint32_t)0x12);
      /* Write Digit 3 on COM5 */
      LCD->RAM[LCD_RAMRegister_10] &= (uint32_t)0xFFE3FFFF;
      LCD->RAM[LCD_RAMRegister_10] |= (uint32_t)(Digit[3] << (uint32_t)0x12);
      /* Write Digit 4 on COM6 */
      LCD->RAM[LCD_RAMRegister_12] &= (uint32_t)0xFFE3FFFF;
      LCD->RAM[LCD_RAMRegister_12] |= (uint32_t)(Digit[4] << (uint32_t)0x12);
      /* Write Digit 5 on COM7 */
      LCD->RAM[LCD_RAMRegister_14] &= (uint32_t)0xFFE3FFFF;
      LCD->RAM[LCD_RAMRegister_14] |= (uint32_t)(Digit[5] << (uint32_t)0x12);
      break;

    /* Position 4 on LCD */
    case 4:
      /* Write Digit 0 on COM0 */
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFFFFFF9;
      LCD->RAM[LCD_RAMRegister_0] |= (uint32_t)(Digit[0] );
      /* Write Digit 1 on COM1 */
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)0xFFFFFFF9;
      LCD->RAM[LCD_RAMRegister_2] |= (uint32_t)(Digit[1]);
      /* Write Digit 2 on COM4 */
      LCD->RAM[LCD_RAMRegister_8] &= (uint32_t)0xFFFFFFF8;
      LCD->RAM[LCD_RAMRegister_8] |= (uint32_t)(Digit[2]);
      /* Write Digit 3 on COM5 */
      LCD->RAM[LCD_RAMRegister_10] &= (uint32_t)0xFFFFFFF8;
      LCD->RAM[LCD_RAMRegister_10] |= (uint32_t)(Digit[3]);
      /* Write Digit 4 on COM6 */
      LCD->RAM[LCD_RAMRegister_12] &= (uint32_t)0xFFFFFFF8;
      LCD->RAM[LCD_RAMRegister_12] |= (uint32_t)(Digit[4]);
      /* Write Digit 5 on COM7 */
      LCD->RAM[LCD_RAMRegister_14] &= (uint32_t)0xFFFFFFF8;
      LCD->RAM[LCD_RAMRegister_14] |= (uint32_t)(Digit[5]);
      break;

      /* Position 5 on LCD */
    case 5:
      /* Write Digit 0 on COM0 */
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFFFFFCF;
      LCD->RAM[LCD_RAMRegister_0] |= (uint32_t)(Digit[0] << (uint32_t)0x03);
      /* Write Digit 1 on COM1 */
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)0xFFFFFFCF;
      LCD->RAM[LCD_RAMRegister_2] |= (uint32_t)(Digit[1] << (uint32_t)0x03);
      /* Write Digit 2 on COM4 */
      LCD->RAM[LCD_RAMRegister_8] &= (uint32_t)0xFFFFFFC7;
      LCD->RAM[LCD_RAMRegister_8] |= (uint32_t)(Digit[2] << (uint32_t)0x03);
      /* Write Digit 3 on COM5 */
      LCD->RAM[LCD_RAMRegister_10] &= (uint32_t)0xFFFFFFC7;
      LCD->RAM[LCD_RAMRegister_10] |= (uint32_t)(Digit[3] << (uint32_t)0x03);
      /* Write Digit 4 on COM6 */
      LCD->RAM[LCD_RAMRegister_12] &= (uint32_t)0xFFFFFFC7;
      LCD->RAM[LCD_RAMRegister_12] |= (uint32_t)(Digit[4] << (uint32_t)0x03);
      /* Write Digit 5 on COM7 */
      LCD->RAM[LCD_RAMRegister_14] &= (uint32_t)0xFFFFFFC7;
      LCD->RAM[LCD_RAMRegister_14] |= (uint32_t)(Digit[5] << (uint32_t)0x03);
      break;

    /* Position 6 on LCD */
    case 6:
      /* Write Digit 0 on COM0 */
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFFFFE7F;
      LCD->RAM[LCD_RAMRegister_0] |= (uint32_t)(Digit[0] << (uint32_t)0x06);
      /* Write Digit 1 on COM1 */
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)0xFFFFFE7F;
      LCD->RAM[LCD_RAMRegister_2] |= (uint32_t)(Digit[1] << (uint32_t)0x06);
      /* Write Digit 2 on COM4 */
      LCD->RAM[LCD_RAMRegister_8] &= (uint32_t)0xFFFFFE3F;
      LCD->RAM[LCD_RAMRegister_8] |= (uint32_t)(Digit[2] << (uint32_t)0x06);
      /* Write Digit 3 on COM5 */
      LCD->RAM[LCD_RAMRegister_10] &= (uint32_t)0xFFFFFE3F;
      LCD->RAM[LCD_RAMRegister_10] |= (uint32_t)(Digit[3] << (uint32_t)0x06);
      /* Write Digit 4 on COM6 */
      LCD->RAM[LCD_RAMRegister_12] &= (uint32_t)0xFFFFFE3F;
      LCD->RAM[LCD_RAMRegister_12] |= (uint32_t)(Digit[4] << (uint32_t)0x06);
      /* Write Digit 5 on COM7 */
      LCD->RAM[LCD_RAMRegister_14] &= (uint32_t)0xFFFFFE3F;
      LCD->RAM[LCD_RAMRegister_14] |= (uint32_t)(Digit[5] << (uint32_t)0x06);
      break;

    default:
      break;
  }
}

/**
  * @brief This function Clear a char in the LCD RAM.
  * @param position: Position in the LCD of the caracter to write.
  *                  This parameter can be any value in range [0:7].
  * @retval None
  */
void LCD_GLASS_ClearChar(uint8_t position)
{
  /*!< Wait Until the last LCD RAM update finish */
  while(LCD_GetFlagStatus(LCD_FLAG_UDR) != RESET)
  {
  }
  switch (position)
  {
    /* Clear position 0 on LCD */
    case 0:
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFFFFBFF;
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)0xFFFFF3FF;
      LCD->RAM[LCD_RAMRegister_8] &= (uint32_t)0xFFFFF1FF;
      LCD->RAM[LCD_RAMRegister_10] &= (uint32_t)0xFFFFF1FF;
      LCD->RAM[LCD_RAMRegister_12] &= (uint32_t)0xFFFFF9FF;
      LCD->RAM[LCD_RAMRegister_14] &= (uint32_t)0xFFFFF1FF;
      break;

    /* Clear position 1 on LCD */
    case 1:
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFFF9FFF;
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)0xFFFF9FFF;
      LCD->RAM[LCD_RAMRegister_8] &= (uint32_t)0xFFFF8FFF;
      LCD->RAM[LCD_RAMRegister_10] &= (uint32_t)0xFFFF8FFF;
      LCD->RAM[LCD_RAMRegister_12] &= (uint32_t)0xFFFF8FFF;
      LCD->RAM[LCD_RAMRegister_14] &= (uint32_t)0xFFFF8FFF;
      break;

    /* Clear position 2 on LCD */
    case 2:
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFFCFFFF;
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)0xFFFCFFFF;
      LCD->RAM[LCD_RAMRegister_8] &= (uint32_t)0xFFFC7FFF;
      LCD->RAM[LCD_RAMRegister_10] &= (uint32_t)0xFFFC7FFF;
      LCD->RAM[LCD_RAMRegister_12] &= (uint32_t)0xFFFC7FFF;
      LCD->RAM[LCD_RAMRegister_14] &= (uint32_t)0xFFFC7FFF;
      break;

    /* Clear position 3 on LCD */
    case 3:
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFE7FFFF;
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)0xFFE7FFFF;
      LCD->RAM[LCD_RAMRegister_8] &= (uint32_t)0xFFE3FFFF;
      LCD->RAM[LCD_RAMRegister_10] &= (uint32_t)0xFFE3FFFF;
      LCD->RAM[LCD_RAMRegister_12] &= (uint32_t)0xFFE3FFFF;
      LCD->RAM[LCD_RAMRegister_14] &= (uint32_t)0xFFE3FFFF;
      break;

    /* Clear position 4 on LCD */
    case 4:
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFFFFFF9;
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)0xFFFFFFF9;
      LCD->RAM[LCD_RAMRegister_8] &= (uint32_t)0xFFFFFFF8;
      LCD->RAM[LCD_RAMRegister_10] &= (uint32_t)0xFFFFFFF8;
      LCD->RAM[LCD_RAMRegister_12] &= (uint32_t)0xFFFFFFF8;
      LCD->RAM[LCD_RAMRegister_14] &= (uint32_t)0xFFFFFFF8;
      break;

    /* Clear position 5 on LCD */
    case 5:
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFFFFFCF;
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)0xFFFFFFCF;
      LCD->RAM[LCD_RAMRegister_8] &= (uint32_t)0xFFFFFFC7;
      LCD->RAM[LCD_RAMRegister_10] &= (uint32_t)0xFFFFFFC7;
      LCD->RAM[LCD_RAMRegister_12] &= (uint32_t)0xFFFFFFC7;
      LCD->RAM[LCD_RAMRegister_14] &= (uint32_t)0xFFFFFFC7;
      break;

