avem-labs/Avem/libs/STM32_USB-FS-Device_Lib_V4.0.0/Utilities/STM32_EVAL/STM32L152D_EVAL/stm32l152d_eval_glass_lcd.c
  /*!< Wait Until the last LCD RAM update finish */
  while(LCD_GetFlagStatus(LCD_FLAG_UDR) != RESET)
  {
  }

  for (counter = 0; counter <= 0x0F; counter++)
  {
    LCD->RAM[counter] = (uint32_t)0x00;
  }

  /*!< Request LCD RAM update */
  LCD_UpdateDisplayRequest();
}

/**
  * @brief  Configure ST Logo display.
  * @param  NewState: enable or disable the logo display .
  * @retval None
  */
void LCD_GLASS_DisplayLogo(FunctionalState NewState)
{
  /*!< Wait Until the last LCD RAM update finish */
  while(LCD_GetFlagStatus(LCD_FLAG_UDR) != RESET)
  {
  }

  if (NewState != DISABLE)
  {
    /* Set logo on  */
    LCD->RAM[LCD_RAMRegister_0] |= (uint32_t)0x00000040;
  }
  else
  {
    /* Set logo of  */
    LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFFFFFBF;
  }

  /*!< Request LCD RAM update */
  LCD_UpdateDisplayRequest();
}

/**
  * @brief  Configure the LCD Battery Level.
  * @param  BatteryLevel: Specify the Battery Level to set.
  * @retval None
  */
void LCD_GLASS_BatteryLevelConfig(BatteryLevel_TypeDef BatteryLevel)
{
  /*!< Wait Until the last LCD RAM update finish */
  while(LCD_GetFlagStatus(LCD_FLAG_UDR) != RESET)
  {
  }

  switch (BatteryLevel)
  {
    /* BATTERYLEVEL 1/4 */
    case BATTERYLEVEL_1_4:
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFFFFFF6;
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)0xFFFFFFF6;
      /* Set BATTERYLEVEL_1_4  on  */
      LCD->RAM[LCD_RAMRegister_0] |= (uint32_t)0x00000001;
      break;

    /* BATTERYLEVEL 1/2 */
    case BATTERYLEVEL_1_2:
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFFFFFF6;
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)0xFFFFFFF6;
      /* Set BatteryLevel_1_4 on  */
      LCD->RAM[LCD_RAMRegister_0] |= (uint32_t)0x00000001;
      /* Set BatteryLevel_1_2 on  */
      LCD->RAM[LCD_RAMRegister_2] |= (uint32_t)0x00000001;
      break;

    /* Battery Level 3/4 */
    case BATTERYLEVEL_3_4:
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFFFFFF6;
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)0xFFFFFFF6;
      /* Set BATTERYLEVEL_3_4 on  */
      /* Set BatteryLevel_1_4 on  */
      LCD->RAM[LCD_RAMRegister_0] |= (uint32_t)0x00000001;
      /* Set BatteryLevel_1_2 on  */
      LCD->RAM[LCD_RAMRegister_2] |= (uint32_t)0x00000009;
      break;

    /* BATTERYLEVEL_FULL */
    case BATTERYLEVEL_FULL:
      /* Set BATTERYLEVEL_3_4 on  */
      /* Set BatteryLevel_1_4 on  */
      LCD->RAM[LCD_RAMRegister_0] |= (uint32_t)0x00000009;
      /* Set BATTERYLEVEL_FULL on  */
      /* Set BatteryLevel_1_2 on  */
      LCD->RAM[LCD_RAMRegister_2] |= (uint32_t)0x00000009;
      break;

    case BATTERYLEVEL_OFF:
      /* Set BATTERYLEVEL_3_4 off  */
      /* Set BATTERYLEVEL_1_4 off  */
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFFFFFF6;
      /* Set BATTERYLEVEL_1_2 off  */
      /* Set BATTERYLEVEL_FULL off  */
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)0xFFFFFFF6;
      break;

    default:
      break;
  }
  /*!< Request LCD RAM update */
  LCD_UpdateDisplayRequest();
}

/**
  * @brief  Configure the LCD ArrowDirection.
  * @param  Arrow: Specify the ArrowDirection to set.
  * @retval None
  */
void LCD_GLASS_ArrowConfig(ArrowDirection_TypeDef ArrowDirection)
{
  /*!< Wait Until the last LCD RAM update finish */
  while(LCD_GetFlagStatus(LCD_FLAG_UDR) != RESET)
  {
  }

  switch (ArrowDirection)
  {
    /* ARROWDIRECTION_UP */
    case ARROWDIRECTION_UP:
      /* Set ARROWDIRECTION_UP on  */
      LCD->RAM[LCD_RAMRegister_0] |= (uint32_t)0x00001000;
      break;

    /* ARROWDIRECTION_LEFT */
    case ARROWDIRECTION_LEFT :
      /* Set ARROWDIRECTION_LEFT on  */
      LCD->RAM[LCD_RAMRegister_2] |= (uint32_t)0x00001000;
      break;

    /* ARROWDIRECTION_DOWN */
    case ARROWDIRECTION_DOWN:
      /* Set ARROWDIRECTION_DOWN on  */
      LCD->RAM[LCD_RAMRegister_2] |= (uint32_t)0x00008000;
      break;

    /* ARROWDIRECTION_RIGHT */
    case ARROWDIRECTION_RIGHT:
      /* Set ARROWDIRECTION_RIGHT on  */
      LCD->RAM[LCD_RAMRegister_0] |= (uint32_t)0x00008000;
      break;

    case ARROWDIRECTION_OFF:
      /* Set ARROWDIRECTION_UP off  */
      /* Set ARROWDIRECTION_RIGHT off  */
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFFF6FFF;
      /* Set ARROWDIRECTION_LEFT off  */
      /* Set ARROWDIRECTION_DOWN off  */
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)0xFFFF6FFF;
      break;

    default:
      break;
  }
  /*!< Request LCD RAM update */
  LCD_UpdateDisplayRequest();
}

/**
  * @brief  Configure the LCD Temperature level display .
  * @param  Temperature: indicate the Temperature level to set.
  * @retval None
  */
void LCD_GLASS_TemperatureConfig(TemperatureLevel_TypeDef Temperature)
{
  /*!< Wait Until the last LCD RAM update finish */
  while(LCD_GetFlagStatus(LCD_FLAG_UDR) != RESET)
  {
  }

  switch (Temperature)
  {
    /* Temperature level 1*/
    case TEMPERATURELEVEL_1 :
      /* Clear Temperature level 5 */
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFFFFDFF;
      /* Clear Temperature level 6 */
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)0xFFFFFDFF;
      /* Clear Temperature level 4 and level 2 */
      LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFFFF3FF;
      /* Clear Temperature level 1 and level 3 */
      LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)0xFFFFF3FF;
      /* Set Temperature level 1*/
      LCD->RAM[LCD_RAMRegister_2] |= (uint32_t)0x00000200;
      break;

    /* Temperature level 2 */
    case TEMPERATURELEVEL_2:
      /* Clear Temperature level 5 */
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFFFFDFF;
      /* Clear Temperature level 6 */
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)0xFFFFFDFF;
      /* Clear Temperature level 4 and level 2 */
      LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFFFF3FF;
      /* Clear Temperature level 1 and level 3 */
      LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)0xFFFFF3FF;
      /* Set Temperature level 1 */
      LCD->RAM[LCD_RAMRegister_2] |= (uint32_t)0x00000200;
      /* Set Temperature level 2 */
      LCD->RAM[LCD_RAMRegister_0] |= (uint32_t)0x00000200;
      break;

      /* Temperature level 3 */
    case TEMPERATURELEVEL_3:
      /* Clear Temperature level 5 */
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFFFFDFF;
      /* Clear Temperature level 6 */
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)0xFFFFFDFF;
      /* Clear Temperature level 4 and level 2 */
      LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFFFF3FF;
      /* Clear Temperature level 1 and level 3 */
      LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)0xFFFFF3FF;
      /* Set Temperature level 1 */
      LCD->RAM[LCD_RAMRegister_2] |= (uint32_t)0x00000200;
      /* Set Temperature level 2 */
      LCD->RAM[LCD_RAMRegister_0] |= (uint32_t)0x00000200;
      /* Set Temperature level 3 */
      LCD->RAM[LCD_RAMRegister_4] |= (uint32_t)0x00000400;
      break;

      /* Temperature level 4*/
    case TEMPERATURELEVEL_4:
      /* Clear Temperature level 5 */
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFFFFDFF;
      /* Clear Temperature level 6 */
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)0xFFFFFDFF;
      /* Clear Temperature level 4 and level 2 */
      LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFFFF3FF;
      /* Clear Temperature level 1 and level 3 */
      LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)0xFFFFF3FF;
      /* Set Temperature level 1  */
      LCD->RAM[LCD_RAMRegister_2] |= (uint32_t)0x00000200;
      /* Set Temperature level 2  */
      LCD->RAM[LCD_RAMRegister_0] |= (uint32_t)0x00000200;
      /* Set Temperature level 3 */
      LCD->RAM[LCD_RAMRegister_4] |= (uint32_t)0x00000400;
      /* Set Temperature level 4 */
      LCD->RAM[LCD_RAMRegister_6] |= (uint32_t)0x00000400;
      break;

