avem-labs/Avem/libs/STM32_USB-FS-Device_Lib_V4.0.0/Utilities/STM32_EVAL/STM32L152D_EVAL/stm32l152d_eval_glass_lcd.c
      /* Temperature_2*/
    case TEMPERATURELEVEL_5:
      /* Clear Temperature level 5 */
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFFFFDFF;
      /* Clear Temperature level 6 */
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)0xFFFFFDFF;
      /* Clear Temperature level 4 and level 2 */
      LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFFFF3FF;
      /* Clear Temperature level 1 and level 3 */
      LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)0xFFFFF3FF;
      /* Set Temperature level 1 */
      LCD->RAM[LCD_RAMRegister_2] |= (uint32_t)0x00000200;
      /* Set Temperature level 2 */
      LCD->RAM[LCD_RAMRegister_0] |= (uint32_t)0x00000200;
      /* Set Temperature level 3 and level 5 */
      LCD->RAM[LCD_RAMRegister_4] |= (uint32_t)0x00000C00;
      /* Set Temperature level 4 */
      LCD->RAM[LCD_RAMRegister_6] |= (uint32_t)0x00000400;
      break;

      /* Temperature_6*/
    case  TEMPERATURELEVEL_6:
      /* Clear Temperature level 5 */
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFFFFDFF;
      /* Clear Temperature level 6 */
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)0xFFFFFDFF;
      /* Clear Temperature level 4 and level 2 */
      LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFFFF3FF;
      /* Clear Temperature level 1 and level 3 */
      LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)0xFFFFF3FF;
      /* Set Temperature level 1 */
      LCD->RAM[LCD_RAMRegister_2] |= (uint32_t)0x00000200;
      /* Set Temperature level 2 */
      LCD->RAM[LCD_RAMRegister_0] |= (uint32_t)0x00000200;
      /* Set Temperature level 3 and level 5 */
      LCD->RAM[LCD_RAMRegister_4] |= (uint32_t)0x00000C00;
      /* Set Temperature level 4 and level 6 */
      LCD->RAM[LCD_RAMRegister_6] |= (uint32_t)0x00000C00;
      break;

    case TEMPERATURELEVEL_OFF:
      /* Clear Temperature level 5 */
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFFFFDFF;
      /* Clear Temperature level 6 */
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)0xFFFFFDFF;
      /* Clear Temperature level 4 and level 2 */
      LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFFFF3FF;
      /* Clear Temperature level 1 and level 3 */
      LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)0xFFFFF3FF;
      break;

    default:
      break;
  }

  /*!< Request LCD RAM update */
  LCD_UpdateDisplayRequest();
}

/**
  * @brief  Configure the LCD Value Unit.
  * @param  ValueUnit: indicate the Value Unit to set.
  * @param  NewState: enable or disable the Digit.
  * @retval None
  */
void LCD_GLASS_ValueUnitConfig(ValueUnit_TypeDef ValueUnit)
{
  /*!< Wait Until the last LCD RAM update finish */
  while(LCD_GetFlagStatus(LCD_FLAG_UDR) != RESET)
  {
  }

  switch (ValueUnit)
  {
    /* VALUEUNIT MILLIAMPERE*/
    case VALUEUNIT_MILLIAMPERE:
      /* Set VALUEUNIT_MILLIAMPERE on  */
      LCD->RAM[LCD_RAMRegister_2] |= (uint32_t)0x00040000;
      break;

    /* VALUEUNIT MICROAMPERE)*/
    case VALUEUNIT_MICROAMPERE:
      /* Set VALUEUNIT_MICROAMPERE  */
      LCD->RAM[LCD_RAMRegister_0] |= (uint32_t)0x00040000;
      break;

    /* VALUEUNIT NANOAMPERE*/
    case  VALUEUNIT_NANOAMPERE:
      /* Set VALUEUNIT_NANOAMPERE on  */
      LCD->RAM[LCD_RAMRegister_2] |= (uint32_t)0x00000040;
      break;

    case  VALUEUNIT_OFF:
      /* Set VALUEUNIT_MILLIAMPERE and VALUEUNIT_NANOAMPERE OFF */
      LCD->RAM[LCD_RAMRegister_2] &= (uint32_t)0xFFFBFFBF;
      /* Set VALUEUNIT_MICROAMPERE off  */
      LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFFBFFFF;
      break;

    default:
      break;
  }
  /*!< Request LCD RAM update */
  LCD_UpdateDisplayRequest();
}

/**
  * @brief  Configure the LCD sign.
  * @param  Sign: indicate the sign to set.
  * @param  NewState: enable or disable the Digit.
  * @retval None
  */
void LCD_GLASS_SignCmd(Sign_TypeDef Sign, FunctionalState NewState)
{
  /*!< Wait Until the last LCD RAM update finish */
  while(LCD_GetFlagStatus(LCD_FLAG_UDR) != RESET)
  {
  }

  if (NewState != DISABLE)
  {
    switch (Sign)
    {
      /* Sign positive */
      case SIGN_POSITIVE:
        /* Set SIGN_POSITIVE on */
        LCD->RAM[LCD_RAMRegister_12] |= (uint32_t)0x00000800;
        break;

      /* Sign negative*/
      case SIGN_NEGATIVE:
        /* Set SIGN_NEGATIVE on */
        LCD->RAM[LCD_RAMRegister_0] |= (uint32_t)0x00000800;
        break;

      default:
        break;
    }
  }
  else
  {
    switch (Sign)
    {
      /* Sign positive */
      case SIGN_POSITIVE:
        /* Set SIGN_POSITIVE off */
        LCD->RAM[LCD_RAMRegister_12] &= (uint32_t)0xFFFFF7FF;
        break;

      /* Sign negative */
      case SIGN_NEGATIVE:
        /* Set SIGN_NEGATIVE off */
        LCD->RAM[LCD_RAMRegister_0] &= (uint32_t)0xFFFFF7FF;
        break;

      default:
        break;
    }
  }

  /*!< Request LCD RAM update */
  LCD_UpdateDisplayRequest();
}
/**
  * @brief  Set Matrix Pixel on.
  * @param  PixelRow: Specify Matrix Row.
  * @param  PixelColumn: Specify Matrix Column.
  * @retval None
  */
void LCD_GLASS_WriteMatrixPixel(PixelRow_TypeDef PixelRow, PixelColumn_TypeDef PixelColumn)
{
  /*!< Wait Until the last LCD RAM update finish */
  while(LCD_GetFlagStatus(LCD_FLAG_UDR) != RESET)
  {
  }

  switch (PixelRow)
  {
    case PIXELROW_1:
      switch (PixelColumn)
      {
        case PIXELCOLUMN_1:
          /* Position : Row = 1 , Column = 1 */
          LCD->RAM[LCD_RAMRegister_6] |= (uint32_t)0x00000200;
          break;

        case PIXELCOLUMN_2:
          /* Position : Row = 1 , Column = 2 */
          LCD->RAM[LCD_RAMRegister_6] |= (uint32_t)0x00004000;
          break;

        case PIXELCOLUMN_3:
          /* Position : Row = 1 , Column = 3 */
          LCD->RAM[LCD_RAMRegister_6] |= (uint32_t)0x00002000;
          break;

        case PIXELCOLUMN_4:
          /* Position : Row = 1 , Column = 4 */
          LCD->RAM[LCD_RAMRegister_6] |= (uint32_t)0x00001000;
          break;

        case PIXELCOLUMN_5:
          /* Position : Row = 1 , Column = 5 */
          LCD->RAM[LCD_RAMRegister_6] |= (uint32_t)0x00020000;
          break;

        case PIXELCOLUMN_6:
          /* Position : Row = 1 , Column = 6 */
          LCD->RAM[LCD_RAMRegister_6] |= (uint32_t)0x00010000;
          break;

        case PIXELCOLUMN_7:
          /* Position : Row = 1 , Column = 7 */
          LCD->RAM[LCD_RAMRegister_6] |= (uint32_t)0x00008000;
          break;

