avem-labs/Avem/libs/STM32_USB-FS-Device_Lib_V4.0.0/Utilities/STM32_EVAL/STM32L152D_EVAL/stm32l152d_eval_glass_lcd.c
        case PIXELCOLUMN_4:
          /* Position : Row = 1 , Column = 4 */
          LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)0xFFFFEFFF;
          break;

        case PIXELCOLUMN_5:
          /* Position : Row = 1 , Column = 5 */
          LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)0xFFFDFFFF;
          break;

        case PIXELCOLUMN_6:
          /* Position : Row = 1 , Column = 6 */
          LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)0xFFFEFFFF;
          break;

        case PIXELCOLUMN_7:
          /* Position : Row = 1 , Column = 7 */
          LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)0xFFFF7FFF;
          break;

        case PIXELCOLUMN_8:
          /* Position : Row = 1 , Column = 8 */
          LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)0xFFEFFFFF;
          break;

        case PIXELCOLUMN_9:
          /* Position : Row = 1 , Column = 9 */
          LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)0xFFF7FFFF;
          break;

        case PIXELCOLUMN_10:
          /* Position : Row = 1 , Column = 10 */
          LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)0xFFFBFFFF;
          break;

        case PIXELCOLUMN_11:
          /* Position : Row = 1 , Column = 11 */
          LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)0xFFFFFFFB;
          break;

        case PIXELCOLUMN_12:
          /* Position : Row = 1 , Column = 12 */
          LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)0xFFFFFFFD;
          break;

        case PIXELCOLUMN_13:
          /* Position : Row = 1 , Column = 13 */
          LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)0xFFFFFFFE;
          break;

        case PIXELCOLUMN_14:
          /* Position : Row = 1 , Column = 14 */
          LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)0xFFFFFFDF;
          break;

        case PIXELCOLUMN_15:
          /* Position : Row = 1 , Column = 15 */
          LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)0xFFFFFFEF;
          break;

        case PIXELCOLUMN_16:
          /* Position : Row = 1 , Column = 16 */
          LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)0xFFFFFFF7;
          break;

        case PIXELCOLUMN_17:
          /* Position : Row = 1 , Column = 17 */
          LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)0xFFFFFEFF;
          break;

        case PIXELCOLUMN_18:
          /* Position : Row = 1 , Column = 18 */
          LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)0xFFFFFF7F;
          break;

        case PIXELCOLUMN_19:
          /* Position : Row = 1 , Column = 19 */
          LCD->RAM[LCD_RAMRegister_6] &= (uint32_t)0xFFFFFFBF;
          break;

        default:
          break;
      }
      break;

    case PIXELROW_2:

      switch (PixelColumn)
      {
        case PIXELCOLUMN_1:
          /* Position : Row = 2 , Column = 1 */
          LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFFFFDFF;
          break;

        case PIXELCOLUMN_2:
          /* Position : Row = 2 , Column = 2 */
          LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFFFBFFF;
          break;

        case PIXELCOLUMN_3:
          /* Position : Row = 2 , Column = 3 */
          LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFFFDFFF;
          break;

        case PIXELCOLUMN_4:
          /* Position : Row = 2 , Column = 4 */
          LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFFFEFFF;
          break;

        case PIXELCOLUMN_5:
          /* Position : Row = 2 , Column = 5 */
          LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFFDFFFF;
          break;

        case PIXELCOLUMN_6:
          /* Position : Row = 2 , Column = 6 */
          LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFFEFFFF;
          break;

        case PIXELCOLUMN_7:
          /* Position : Row = 2 , Column = 7 */
          LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFFF7FFF;
          break;

        case PIXELCOLUMN_8:
          /* Position : Row = 2 , Column = 8 */
          LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFEFFFFF;
          break;

        case PIXELCOLUMN_9:
          /* Position : Row = 2 , Column = 9 */
          LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFF7FFFF;
          break;

        case PIXELCOLUMN_10:
          /* Position : Row = 2 , Column = 10 */
          LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFFBFFFF;
          break;

        case PIXELCOLUMN_11:
          /* Position : Row = 2 , Column = 11 */
          LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFFFFFFB;
          break;

        case PIXELCOLUMN_12:
          /* Position : Row = 2 , Column = 12 */
          LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFFFFFFD;
          break;

        case PIXELCOLUMN_13:
          /* Position : Row = 2 , Column = 13 */
          LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFFFFFFE;
          break;

        case PIXELCOLUMN_14:
          /* Position : Row = 2 , Column = 14 */
          LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFFFFFDF;
          break;

        case PIXELCOLUMN_15:
          /* Position : Row = 2 , Column = 15 */
          LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFFFFFEF;
          break;

        case PIXELCOLUMN_16:
          /* Position : Row = 2 , Column = 16 */
          LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFFFFFF7;
          break;

        case PIXELCOLUMN_17:
          /* Position : Row = 2 , Column = 17 */
          LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFFFFEFF;
          break;

        case PIXELCOLUMN_18:
          /* Position : Row = 2 , Column = 18 */
          LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFFFFF7F;
          break;

        case PIXELCOLUMN_19:
          /* Position : Row = 2 , Column = 19 */
          LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFFFFFBF;
          break;

        default:
          break;
      }
      break;

    case PIXELROW_3:
      switch (PixelColumn)
      {
        case PIXELCOLUMN_1:
          /* Position : Row = 3 , Column = 1 */
          LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFDFFFFF;
          break;

        case PIXELCOLUMN_2:
          /* Position : Row = 3 , Column = 2 */
          LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFFBFFFFF;
          break;

        case PIXELCOLUMN_3:
          /* Position : Row = 3 , Column = 3 */
          LCD->RAM[LCD_RAMRegister_4] &= (uint32_t)0xFF7FFFFF;
          break;

