avem-labs/Avem/libs/STM32_USB-FS-Device_Lib_V4.0.0/Utilities/STM32_EVAL/STM32L152D_EVAL/stm32l152d_eval_glass_lcd.c
        case PIXELCOLUMN_4:
          /* Position : Row = 9 , Column = 4 */
          LCD->RAM[LCD_RAMRegister_10] &= (uint32_t)0xFEFFFFFF;
          break;

        case PIXELCOLUMN_5:
          /* Position : Row = 9 , Column = 5 */
          LCD->RAM[LCD_RAMRegister_10] &= (uint32_t)0xFDFFFFFF;
          break;

        case PIXELCOLUMN_6:
          /* Position : Row = 9 , Column = 6 */
          LCD->RAM[LCD_RAMRegister_10] &= (uint32_t)0xFBFFFFFF;
          break;

        case PIXELCOLUMN_7:
          /* Position : Row = 9 , Column = 7 */
          LCD->RAM[LCD_RAMRegister_10] &= (uint32_t)0xF7FFFFFF;
          break;

        case PIXELCOLUMN_8:
          /* Position : Row = 9 , Column = 8 */
          LCD->RAM[LCD_RAMRegister_10] &= (uint32_t)0xEFFFFFFF;
          break;

        case PIXELCOLUMN_9:
          /* Position : Row = 9 , Column = 9*/
          LCD->RAM[LCD_RAMRegister_10] &= (uint32_t)0xDFFFFFFF;
          break;

        case PIXELCOLUMN_10:
          /* Position : Row = 9 , Column = 10*/
          LCD->RAM[LCD_RAMRegister_10] &= (uint32_t)0xBFFFFFF;
          break;

        case PIXELCOLUMN_11:
          /* Position : Row = 9 , Column = 11*/
          LCD->RAM[LCD_RAMRegister_10] &= (uint32_t)0x7FFFFFFF;
          break;

        case PIXELCOLUMN_12:
          /* Position : Row = 9 , Column = 12*/
          LCD->RAM[LCD_RAMRegister_11] &= (uint32_t)0xFFFFFFFE;
          break;

        case PIXELCOLUMN_13:
          /* Position : Row = 9 , Column = 13*/
          LCD->RAM[LCD_RAMRegister_11] &= (uint32_t)0xFFFFFFFD;
          break;

        case PIXELCOLUMN_14:
          /* Position : Row = 9 , Column = 14*/
          LCD->RAM[LCD_RAMRegister_11] &= (uint32_t)0xFFFFFFFB;
          break;

        case PIXELCOLUMN_15:
          /* Position : Row = 9 , Column = 15*/
          LCD->RAM[LCD_RAMRegister_11] &= (uint32_t)0xFFFFFFF7;
          break;

        case PIXELCOLUMN_16:
          /* Position : Row = 9 , Column = 16*/
          LCD->RAM[LCD_RAMRegister_11] &= (uint32_t)0xFFFFFFEF;
          break;

        case PIXELCOLUMN_17:
          /* Position : Row = 9 , Column = 17*/
          LCD->RAM[LCD_RAMRegister_11] &= (uint32_t)0xFFFFFFDF;
          break;

        case PIXELCOLUMN_18:
          /* Position : Row = 9 , Column = 18*/
          LCD->RAM[LCD_RAMRegister_11] &= (uint32_t)0xFFFFFFBF;
          break;

        case PIXELCOLUMN_19:
          /* Position : Row = 9 , Column = 19 */
          LCD->RAM[LCD_RAMRegister_11] &= (uint32_t)0xFFFFFF7F;
          break;

        default:
          break;
      }
      break;

    case PIXELROW_10:
      switch (PixelColumn)
      {
        case PIXELCOLUMN_1:
          /* Position : Row = 10 , Column = 1 */
          LCD->RAM[LCD_RAMRegister_8] &= (uint32_t)0xFFDFFFFF;
          break;

        case PIXELCOLUMN_2:
          /* Position : Row = 10 , Column = 2 */
          LCD->RAM[LCD_RAMRegister_8] &= (uint32_t)0xFFBFFFFF;
          break;

        case PIXELCOLUMN_3:
          /* Position : Row = 10 , Column = 3 */
          LCD->RAM[LCD_RAMRegister_8] &= (uint32_t)0xFF7FFFFF;
          break;

        case PIXELCOLUMN_4:
          /* Position : Row = 10 , Column = 4 */
          LCD->RAM[LCD_RAMRegister_8] &= (uint32_t)0xFEFFFFFF;
          break;

        case PIXELCOLUMN_5:
          /* Position : Row = 10 , Column = 5 */
          LCD->RAM[LCD_RAMRegister_8] &= (uint32_t)0xFDFFFFFF;
          break;

        case PIXELCOLUMN_6:
          /* Position : Row = 10 , Column = 6 */
          LCD->RAM[LCD_RAMRegister_8] &= (uint32_t)0xFBFFFFFF;
          break;

        case PIXELCOLUMN_7:
          /* Position : Row = 10 , Column = 7 */
          LCD->RAM[LCD_RAMRegister_8] &= (uint32_t)0xF7FFFFFF;
          break;

        case PIXELCOLUMN_8:
          /* Position : Row = 10 , Column = 8 */
          LCD->RAM[LCD_RAMRegister_8] &= (uint32_t)0xEFFFFFFF;
          break;

        case PIXELCOLUMN_9:
          /* Position : Row = 10 , Column = 9*/
          LCD->RAM[LCD_RAMRegister_8] &= (uint32_t)0xDFFFFFFF;
          break;

        case PIXELCOLUMN_10:
          /* Position : Row = 10 , Column = 10*/
          LCD->RAM[LCD_RAMRegister_8] &= (uint32_t)0xBFFFFFFF;
          break;

        case PIXELCOLUMN_11:
          /* Position : Row = 10 , Column = 11*/
          LCD->RAM[LCD_RAMRegister_8] &= (uint32_t)0x7FFFFFFF;
          break;

        case PIXELCOLUMN_12:
          /* Position : Row = 10 , Column = 12*/
          LCD->RAM[LCD_RAMRegister_9] &= (uint32_t)0xFFFFFFFE;
          break;

        case PIXELCOLUMN_13:
          /* Position : Row = 10 , Column = 13*/
          LCD->RAM[LCD_RAMRegister_9] &= (uint32_t)0xFFFFFFFD;
          break;

        case PIXELCOLUMN_14:
          /* Position : Row = 10 , Column = 14*/
          LCD->RAM[LCD_RAMRegister_9] &= (uint32_t)0xFFFFFFFB;
          break;

        case PIXELCOLUMN_15:
          /* Position : Row = 10 , Column = 15*/
          LCD->RAM[LCD_RAMRegister_9] &= (uint32_t)0xFFFFFFF7;
          break;

        case PIXELCOLUMN_16:
          /* Position : Row = 10 , Column = 16*/
          LCD->RAM[LCD_RAMRegister_9] &= (uint32_t)0xFFFFFFEF;
          break;

        case PIXELCOLUMN_17:
          /* Position : Row = 10 , Column = 17*/
          LCD->RAM[LCD_RAMRegister_9] &= (uint32_t)0xFFFFFFDF;
          break;

        case PIXELCOLUMN_18:
          /* Position : Row = 10 , Column = 18*/
          LCD->RAM[LCD_RAMRegister_9] &= (uint32_t)0xFFFFFFBF;
          break;

        case PIXELCOLUMN_19:
          /* Position : Row = 10 , Column = 19 */
          LCD->RAM[LCD_RAMRegister_9] &= (uint32_t)0xFFFFFF7F;
          break;

        default:
          break;
      }
    break;
  }

  /*!< Request LCD RAM update */
  LCD_UpdateDisplayRequest();
}

/**
  * @brief  Converts an ascii char to the a LCD Digit (previous coding).
  * @param  c: a char to display.
  * @param  Point: a point to add in front of a char
  *         This parameter can be: POINT_OFF or POINT_ON
  * @param  DoublePoint: flag indicating if Double Point has to be added in front
  *         of the displayed character.
  *         This parameter can be: DOUBLEPOINT_ON or DOUBLEPOINT_OFF.
  * @retval None
  */
static void Convert(uint8_t* c, Point_Typedef Point, DoublePoint_Typedef DoublePoint)
{
  uint32_t ch = 0 , tmp = 0;
  uint8_t i = 0;

